export const SK_MILITARY_STATUS_CODES = new Map<string, string>([
  ["군필", "302001"],
  ["미필", "302002"],
  ["면제", "302003"],
  ["복무중", "302004"],
]);
export const SK_MILITARY_TYPE_CODES = new Map<string, string>([
  ["현역병", "303001"],
  ["상근예비역", "303002"],
  ["공익근무요원", "303003"],
  ["전문연구요원", "303004"],
  ["산업기능요원", "303005"],
]);
export const SK_MILITARY_BRANCH_CODES = new Map<string, string>([
  ["육군", "304001"],
  ["해군", "304002"],
  ["공군", "304003"],
  ["해병대", "304004"],
  ["전투경찰", "304005"],
  ["해양경찰", "304006"],
  ["의무경찰", "304007"],
  ["의무소방", "304008"],
]);
export const SK_DISABILITY_GRADE_CODES = new Map<string, string>([
  ["중증(기존1급~3급)", "306001"],
  ["경증(기존4급~6급)", "306002"],
]);
export const SK_DISABILITY_TYPE_CODES = new Map<string, string>([
  ["지체장애", "307014"],
  ["뇌병변장애", "307003"],
  ["시각장애", "307004"],
  ["청각장애", "307009"],
  ["언어장애", "307015"],
  ["지적장애", "307011"],
  ["자폐성장애", "307012"],
  ["정신장애", "307008"],
  ["신장장애", "307005"],
  ["심장장애", "307006"],
  ["호흡기장애", "307010"],
  ["간장애", "307001"],
  ["안면장애", "307007"],
  ["장루·요루장애", "307016"],
  ["뇌전증장애", "307002"],
  ["췌장장애", "307017"],
]);

export const SK_POSITIVE_CODE = "1";
export const SK_NEGATIVE_CODE = "0";
